<?php

namespace app\etick\api;

class Status{

    static public $ERROR_STATUS = array(
        0 => '正常',
        -1 => '测试',
        100 => '用户名长度不符',
        101 => '用户名已存在',
        102 => '用户名不存在',
        103 => '用户名或密码错误',
        104 => '未登录',
        105 => '封号',
        106 => '已签到',
        107 => '手机号长度不符',
        108 => '手机号已存在',
        109 => '用户名为空',
        110 => '用户名至少5个字符',
        111 => '用户名最多30个字符',
        112 => '密码为空',
        113 => '密码至少5个字符',
        114 => '密码最多30个字符',
        115 => '手机号为空',
        116 => '手机号码格式错误');
}
